Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t
Struct for the input data for preview polygonal pour break.

Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t.nPolylinePoints
The constant size of the Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t.aPolylinePoints array.

Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t.aPolylinePoints
The array containing the polyline points.

Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t.ExtensionDirection
The extension direction.